{
    "about": "Привет, меня зовут Геннадий",
    "about_descr":"Я переучился на front-end разработчика в ходе работы в инженерно-строительной сфере. Хоть у меня нет прямого опыта работы в IT-отрасли, я приобрел опыт работы с программами для моделирования и визуализации, что помогло мне лучше понять, как создавать функциональные и эстетически приятные интерфейсы.",
    "about_phone": "Телефон",
    "about_address_title": "Адрес",
    "about_address_descr": "г. Санкт-Петербург, м. Чернышевская",
    "about_address_btn1": "связаться со мной",
    "about_address_btn2": "скачать резюме",

    "all": "Все проекты",

    "skills":"Стэк",
    "skills_descr":"Я вдохновлен программированием и стремлюсь к развитию своих навыков в front-end разработке. Я люблю изучать новые технологии и подходы и делаю это фундаментально, чтобы глубоко понимать теорию и базовые концепции. Я уверен, что мой опыт и желание учиться новому сделают меня ценным активом для вашей команды.",
    
    "experience":"Опыт",
    "experience_descr" : "Я переучился на front-end разработчика в ходе работы в инженерно-строительной сфере.Хоть у меня нет прямого опыта работы в IT-отрасли, я приобрел опыт работы с программами для моделирования и визуализации, что помогло мне лучше понять, как создавать функциональные и эстетически приятные интерфейсы.",

    "experience_one_name":"Инженер ПТО",
    "experience_one_company":"ООО 'НЭНСИ'",
    "experience_one_date":"Сентябрь, 2019 — Май, 2021",
    "experience_one_descr":"Рассмотрение и согласование проектных решений возникающих в ходе проектирования объекта.Подготовка, ведение и сдача в производство эскизных и рабочих чертежей изделий различной степени сложности при вводе заказа.Создание фотораскроев и визуализаций проектов из натурального камня;Подготовка необходимых документов для Заказчика, монтажного отдела, Отдела продаж и производства;Расчёт объемов;Участие в решении вопросов о внесении в проект изменений и дополнений;Ведение документации, необходимой для сдачи заказа.",

    "experience_two_name":"Ведущий специалист",
    "experience_two_company":"ЛО ГУП «Недвижимость»",
    "experience_two_date":"Май 2021 — настоящее время",
    "experience_two_descr":"Ленинградское областное государственное унитарное предприятие технической инвентаризации и оценки недвижимости",
    

    "experience_three_name":"Индивидуальное предпринимательство / частная практика / фриланс",
    "experience_three_date":"Май 2022 — настоящее время",
    "experience_three_descr":"Разработчик фронтэнда. Разработка сайтов на WebFlow и интеграция в Shopify .Изготовление сайтов из макетов в Figma . Разработка сайтов на конструкторе Tilda с интегрированным html + js",



    "education":"Образование",
    "education_descr":"Я уверен, что мой опыт и желание учиться новому сделают меня ценным активом для вашей команды. Я готов работать над проектами, которые будут не только инновационными, но и полезными для пользователей.",

    "education_one_name":"СПБГАУ",
    "education_one_degree":"Диплом бакалавра",
    "education_one_date":"Сентябрь, 2014 — Июнь, 2018",
    "education_one_descr":"Обучался в Санкт-Петербургском Государственном Аграрном университете на факультете: Промышленное гражданское строительство",

    "education_two_name":"СПБПУ Петра Великого",
    "education_two_degree":"Диплом магистра",
    "education_two_date":"Сентябрь, 2018 — Июнь, 2020",
    "education_two_descr":"Окончил Санкт-Петербургский политехнический университет Петра Великого факультет: Градостроительство",

    "education_three_name":"UDEMY WEB-разработчик",
    "education_three_degree":"Курсы",
    "education_three_date":"Август, 2022 — Декабрь, 2022",
    "education_three_descr":"Окончил Санкт-Петербургский политехнический университет Петра Великого факультет: Градостроительство",

    "education_four_name":"UDEMY Полный курс по JavaScript + React",
    "education_four_degree":"Курсы",
    "education_four_date":"Январь, 2023 — Июль, 2023",
    "education_four_descr":"Окончил Санкт-Петербургский политехнический университет Петра Великого факультет: Градостроительство",
    
    "portfolio": "Портфолио",

    "message": "Сообщение",
    "name": "Имя",
    "contacts": "Контакты",
    "contacts_descr": "Спасибо что ознакомились с моим резюме. Если я заинтересовал вас, вы можете связаться со мной",
    "contact_btn": "отправить сообщение",

    "confidentiality": "Конфиденциальность"
}